Revit 2027 API
ParameterTypeId.EllipseModificationKeepsRatio Property
 "Keep Ratio"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EllipseModificationKeepsRatio { get; }
Public Shared ReadOnly Property EllipseModificationKeepsRatio As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EllipseModificationKeepsRatio {
	ForgeTypeId^ get ();
}
static member EllipseModificationKeepsRatio : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace